In [3]:
import pandas as pd

In [2]:
dict_1={"car":["city","ignis","800","Verna","Venue","Punto"],"brand":["Honda","maruti","Maruti","Hyundia","Hyundai","Fiat"],
         "cost":[900000,600000,100000,800000,950000,750000],"year":[5,7,10,4,2,6]} 
auto= pd.DataFrame(dict_1)
auto

     car    brand    cost  year
0   city    Honda  900000     5
1  ignis   maruti  600000     7
2    800   Maruti  100000    10
3  Verna  Hyundia  800000     4
4  Venue  Hyundai  950000     2
5  Punto     Fiat  750000     6

In [ ]:
auto.to_csv("automobile.csv")

In [4]:
new = pd.read_csv("automobile.csv")
new

   Unnamed: 0    car    brand    cost  year
0           0   city    Honda  900000     5
1           1  ignis   maruti  600000     7
2           2    800   Maruti  100000    10
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2
5           5  Punto     Fiat  750000     6

In [5]:
new.head()#prints first 5 rows

   Unnamed: 0    car    brand    cost  year
0           0   city    Honda  900000     5
1           1  ignis   maruti  600000     7
2           2    800   Maruti  100000    10
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2

In [6]:
new.tail()#last 5

   Unnamed: 0    car    brand    cost  year
1           1  ignis   maruti  600000     7
2           2    800   Maruti  100000    10
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2
5           5  Punto     Fiat  750000     6

In [7]:
new.columns

Index(['Unnamed: 0', 'car', 'brand', 'cost', 'year'], dtype='object')

In [8]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  6 non-null      int64
 1   car         6 non-null      object
 2   brand       6 non-null      object
 3   cost        6 non-null      int64
 4   year        6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 368.0+ bytes

In [9]:
new.shape

(6, 5)

In [10]:
new['car'].value_counts()

800      1
Punto    1
Venue    1
Verna    1
ignis    1
city     1
Name: car, dtype: int64

In [11]:
new["brand"].unique()

array(['Honda', 'maruti', 'Maruti', 'Hyundia', 'Hyundai', 'Fiat'],
      dtype=object)

In [12]:
h = new['brand'].unique()
print(h)

['Honda' 'maruti' 'Maruti' 'Hyundia' 'Hyundai' 'Fiat']

In [13]:
new[['car','brand']]

     car    brand
0   city    Honda
1  ignis   maruti
2    800   Maruti
3  Verna  Hyundia
4  Venue  Hyundai
5  Punto     Fiat

In [14]:
new.iloc[[0,1,2]]

   Unnamed: 0    car   brand    cost  year
0           0   city   Honda  900000     5
1           1  ignis  maruti  600000     7
2           2    800  Maruti  100000    10

In [15]:
new.loc[1:5:2,['brand','car']]

     brand    car
1   maruti  ignis
3  Hyundia  Verna
5     Fiat  Punto

In [16]:
b = new.loc[1,"brand"]
print(b)
new.iloc[1,2]

maruti

'maruti'

In [17]:
up = new["brand"]=="Honda"
up

0     True
1    False
2    False
3    False
4    False
5    False
Name: brand, dtype: bool

In [18]:
new.loc[up]

   Unnamed: 0   car  brand    cost  year
0           0  city  Honda  900000     5

In [19]:
new.loc[3,:]

Unnamed: 0          3
car             Verna
brand         Hyundia
cost           800000
year                4
Name: 3, dtype: object

In [20]:
new.loc[3:5,["car","brand"]]

     car    brand
3  Verna  Hyundia
4  Venue  Hyundai
5  Punto     Fiat

In [21]:
rows = [2,3,5]
new.loc[rows,"car":"cost"]

     car    brand    cost
2    800   Maruti  100000
3  Verna  Hyundia  800000
5  Punto     Fiat  750000

In [22]:
new.loc[new.cost>750000,:]

   Unnamed: 0    car    brand    cost  year
0           0   city    Honda  900000     5
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2

In [23]:
new.loc[new.cost>750000,"car":"cost"]

     car    brand    cost
0   city    Honda  900000
3  Verna  Hyundia  800000
4  Venue  Hyundai  950000

In [24]:
new.iloc[[3,5],[1,3]]

     car    cost
3  Verna  800000
5  Punto  750000

In [25]:
a = new['car'].isin(['Punto'])#case_sensitive
new.loc[a]

   Unnamed: 0    car brand    cost  year
5           5  Punto  Fiat  750000     6

In [26]:
b= new['brand'].str.startswith('H')
new.loc[b]

   Unnamed: 0    car    brand    cost  year
0           0   city    Honda  900000     5
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2

In [27]:
ends = new['car'].str.endswith('s')
new.loc[ends]

   Unnamed: 0    car   brand    cost  year
1           1  ignis  maruti  600000     7

In [28]:
have = ~new['car'].str.contains('g')
new.loc[have]#negation=opposite

   Unnamed: 0    car    brand    cost  year
0           0   city    Honda  900000     5
2           2    800   Maruti  100000    10
3           3  Verna  Hyundia  800000     4
4           4  Venue  Hyundai  950000     2
5           5  Punto     Fiat  750000     6

In [29]:
new.loc[-have]#minus sym. so opposite of prev. o/p

   Unnamed: 0    car   brand    cost  year
1           1  ignis  maruti  600000     7

In [ ]:
c = new['car'].isna()#returns NaN values
new.loc[c]

In [ ]:
d = new['car'].notna()
new.loc[d]

In [ ]:
new.sort_values("cost")

In [ ]:
new.sort_values(["year","cost"], ascending = [True,True])#first come first serve

In [ ]:
new.columns=[x.capitalize() for x in new.columns]
new

In [ ]:
new.columns=[x.lower() for x in new.columns]
new

In [ ]:
new.rename(columns={"brand":"model"},inplace = True)
new

In [ ]:
new['cost'] = new['cost'].replace({900000:230000})
new

In [ ]:
new["car"]=new["car"].apply(str.upper)
new

In [ ]:
def value_change(cost):
    return cost+12345

In [ ]:
new["cost"] = new["cost"].apply(value_change)
new

In [ ]:
b=new["cost"].apply(lambda x : x*100)
new